# Multiply Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..Multiply Method
Transform1D Class See Also
---
Multiplies this transformation by the specified transformation and returns the result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform1D Multiply(
	Transform1D right
)
```

Visual Basic
---
```text
Public Function Multiply ( _
	right As Transform1D _
) As Transform1D
```

Visual C++
---
```text
public:
Transform1D^ Multiply(
	Transform1D^ right
)
```

# ### Parameters
right
    Type: Autodesk.Revit.DB..::..Transform1D The input transformation.
# ### Return Value
The transformation equal to the composition of the two transformations.
# Remarks
The combined transformation has the same effect as applying the input transformation first, and this transformation, second. So, (T1(T2(p)) = (T1 * T2) (p).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Transform1D Class
Autodesk.Revit.DB Namespace